Revit 2024 API
FabricationServiceButton.ConditionCount Property
 The number of conditions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int ConditionCount { get; }
Visual Basic
Public ReadOnly Property ConditionCount As Integer
	Get
Visual C++
public:
property int ConditionCount {
	int get ();
}
See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace